Revit 2024 API
UIFabricationUtils.SetOpenConnectorIndicatorTowardsColor Method
 Sets the color of the open connector indicator in towards direction
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public static void SetOpenConnectorIndicatorTowardsColor(
	Color color
)
Visual Basic
Public Shared Sub SetOpenConnectorIndicatorTowardsColor ( _
	color As Color _
)
Visual C++
public:
static void SetOpenConnectorIndicatorTowardsColor(
	Color^ color
)
Parameters
color
Type: Autodesk.Revit.DB.Color
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
UIFabricationUtils Class
Autodesk.Revit.UI Namespace